{
  "title": "People with this certain gene version less likely to develop severe COVID-19",
  "url": "https://techncruncher.blogspot.com/2022/01/people-with-this-certain-gene-version.html",
  "date": "Sun, 23 Jan 2022 12:09:00 +0000",
  "author": "noreply@blogger.com (Unknown)",
  "content": "<table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" ><tbody><tr><td ><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgsub-aBgX01FgFuJaxfY8FqQ1QzD4xsJlvkKG1FG5QIHcNOdHgFMzSerSvrGW8PIaYGt1ogZEuVufoiUxcm0Ux0BA8BIUzk6dBQtTJxyuyhr5gwswjSHg7gew5eXH2T3NUdo6Aeuc7mqKovTGAu_zSVclpQPhZ1z5D4tA9aQgLRcWQjqOfPdoV3hbW_w=s1280\" imageanchor=\"1\" ><span ><img alt=\"omicron\" border=\"0\" data-original-height=\"640\" data-original-width=\"1280\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgsub-aBgX01FgFuJaxfY8FqQ1QzD4xsJlvkKG1FG5QIHcNOdHgFMzSerSvrGW8PIaYGt1ogZEuVufoiUxcm0Ux0BA8BIUzk6dBQtTJxyuyhr5gwswjSHg7gew5eXH2T3NUdo6Aeuc7mqKovTGAu_zSVclpQPhZ1z5D4tA9aQgLRcWQjqOfPdoV3hbW_w=w640-h320\" title=\"omicron\" width=\"640\" /></span></a></td></tr><tr><td class=\"tr-caption\" ></td></tr></tbody></table><span ><br /></span><p><span >The new results show that people with a specific version of a gene are less likely to develop severe COVID-19. Earlier research had identified a specific group of genes, called the OAS1/2/3 gene cluster, as being involved in the risk for severe COVID-19.&nbsp;</span></p><p><span >One version of a gene in that cluster –passed down from Neanderthals, appeared to protect against serious disease, reducing&nbsp; risk by about 23%. Previous research was mostly done on people of European ancestory. Researchers are now seeing the same association of this genetic variant with less severe COVID-19 in people of African ancestory, according to a report published in Nature Genetics.</span></p><p><span >&nbsp;\"The fact that people of African descent had the same protection allowed us to identify the only variant in&nbsp; DNA that actually protects against COVID19 infection. co-author dr. Jennifer Huffman&nbsp; said in a statement.</span></p><p><span >&nbsp;OAS genes are involved in a cascade of effects that help cells fight viruses, the researchers said. Understanding these genes and their impact on COVID19 risks could aid in the development of future drugs, they added.</span></p><h3 ><span >Fewer Delta breakthroughs with Moderna vs Pfizer/BioNTech</span></h3><p><span >When the delta variant&nbsp; coronavirus was widespread in the United States, recipients of two doses of Moderna's mRNA vaccine (MRNA.O) were less likely to have breakthrough infection&nbsp; and&nbsp; were slightly less likely to be hospitalized&nbsp; than recipients of two doses of&nbsp; mRNA vaccine from Pfizer and BioNTech, found a large study.&nbsp;</span></p><p><span >The researchers analyzed the medical records of more than 637,000 vaccine recipients who had not previously been infected with the virus and had not received a booster shot.</span></p><p><span >&nbsp;As reported in JAMA on Thursday, advanced infections increased steadily each month from July through November 2021, with higher rates in the Pfizer/BioNTech group.&nbsp;</span></p><p><span >In November, there were 2.8 cases per thousand people vaccinated with the Pfizer/BioNTech injections compared to 1.6 cases per thousand recipients of the Moderna vaccines.</span></p>",
  "image": "https://blogger.googleusercontent.com/img/a/AVvXsEgsub-aBgX01FgFuJaxfY8FqQ1QzD4xsJlvkKG1FG5QIHcNOdHgFMzSerSvrGW8PIaYGt1ogZEuVufoiUxcm0Ux0BA8BIUzk6dBQtTJxyuyhr5gwswjSHg7gew5eXH2T3NUdo6Aeuc7mqKovTGAu_zSVclpQPhZ1z5D4tA9aQgLRcWQjqOfPdoV3hbW_w=w640-h320",
  "description": "The latest tech news about the world's best (and worst) hardware, apps, games and Product Reviews much more. From top companies like Google and Apple.",
  "publisher": "Techcrunch",
  "publisherUrl": "https://www.techcrunch.com"
}