{
  "title": "Russian c.bank proposes banning cryptocurrencies, crypto mining",
  "url": "https://techncruncher.blogspot.com/2022/01/russian-cbank-proposes-banning.html",
  "date": "Thu, 20 Jan 2022 12:56:00 +0000",
  "author": "noreply@blogger.com (Unknown)",
  "content": "<table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" ><tbody><tr><td ><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEh8Ab2fniYX1LMiTt-SPNcljyB-NxzIH1dlQTxEvcspfJZA-dwAY1rGM3kB4TV9RsJFUZg-x_0n7tfSr8j-WBwrBpsKE543Zdyd75jKXHVcGwSjeuqaueLN4BpkzkxjM3ik7yYdc9yCr_qRRy32QlvV9DtvFZefdtdqiYPTvpZHgVUVFKfbADao2NjVIQ=s960\" ><span ><img alt=\"crypto currency\" border=\"0\" data-original-height=\"591\" data-original-width=\"960\" height=\"394\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEh8Ab2fniYX1LMiTt-SPNcljyB-NxzIH1dlQTxEvcspfJZA-dwAY1rGM3kB4TV9RsJFUZg-x_0n7tfSr8j-WBwrBpsKE543Zdyd75jKXHVcGwSjeuqaueLN4BpkzkxjM3ik7yYdc9yCr_qRRy32QlvV9DtvFZefdtdqiYPTvpZHgVUVFKfbADao2NjVIQ=w640-h394\" title=\"crypto currency\" width=\"640\" /></span></a></td></tr><tr><td class=\"tr-caption\" >Representations of virtual cryptocurrencies are seen in this illustration taken November 28, 2021. REUTERS/Dado Ruvic/Illustration/File Photo<span><a name='more'></a></span></td></tr></tbody></table><p><span face=\"&quot;Encode Sans&quot;, system-ui, -apple-system, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, &quot;Noto Sans&quot;, &quot;Liberation Sans&quot;, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;, &quot;Noto Color Emoji&quot;\" >Russia's central bank on Thursday proposed banning the use and mining of cryptocurrencies&nbsp;</span><span face=\"&quot;Encode Sans&quot;, system-ui, -apple-system, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, &quot;Noto Sans&quot;, &quot;Liberation Sans&quot;, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;, &quot;Noto Color Emoji&quot;\" >on Russian territory, citing threats to financial stability, citizens' wellbeing and its monetary policy sovereignty.</span></p><p >The move is the latest in a global cryptocurrency crackdown as governments from Asia to the United States worry that privately operated highly volatile digital currencies could undermine their control of financial and monetary systems.</p><p >Russia has argued for years against cryptocurrencies, saying they could be used in money laundering or to finance terrorism. It eventually gave them legal status in 2020 but banned their use as a means of payment.</p><p >In December, the price of bitcoin fell after Reuters reported, citing sources, that Russia's regulator was in favour of a complete ban on cryptocurrencies.</p><iframe frameborder=\"0\" height=\"250\" scrolling=\"no\" src=\"//assertedclosureseaman.com/watchnew?key=302372165fcdeb117a0acc3571473224\" width=\"300\"></iframe><p >In a report published on Thursday, the central bank said speculative demand primarily determined cryptocurrencies' rapid growth and that they carried characteristics of a financial pyramid, warning that bubbles in the market could form, threatening financial stability and citizens.</p><div class=\"collapse show\" id=\"viewFullText\" ><p >The bank proposed preventing financial institutions from carrying out any operations with cryptocurrencies and said mechanisms should be developed to block transactions aimed at buying or selling cryptocurrencies for fiat, or traditional currencies. The proposed ban includes crypto exchanges.</p><p >Russians are active cryptocurrency users, the central bank said, with an annual transaction volume of about $5 billion.</p><p >CRYPTO MINING</p><p >Russia is the world's third-largest player in bitcoin mining, behind the United States and Kazakhstan, though the latter may see a miner exodus over fears of tightening regulation following unrest earlier this month. read more</p><iframe frameborder=\"0\" height=\"250\" scrolling=\"no\" src=\"//assertedclosureseaman.com/watchnew?key=aeca13d083f5b3719e28123bb76b9ed4\" width=\"300\"></iframe><p >The central bank said crypto mining created problems for energy consumption. Bitcoin and other cryptocurrencies are \"mined\" by powerful computers that compete against others hooked up to a global network to solve complex mathematical puzzles. The process guzzles electricity and is often powered by fossil fuels.</p><p >\"The best solution is to introduce a ban on cryptocurrency mining in Russia,\" the bank said.</p><p >In August, Russia accounted for 11.2% of the global \"hashrate\" - crypto jargon for the amount of computing power being used by computers connected to the bitcoin network.</p><iframe 0px=\"\" 2em=\"\" border-box=\"\" box-sizing:=\"\" margin-bottom:=\"\" margin-top:=\"\" src=\"//assertedclosureseaman.com/watchnew?key=&lt;p box-sizing: border-box; margin-bottom: 2em; margin-top: 0px;\">In September, China intensified its crackdown on cryptocurrencies with a blanket ban on all crypto transactions and mining, hitting bitcoin and other major coins and pressuring crypto and blockchain-related stocks.</p><p >Russia's regulator said crypto assets becoming widespread would limit the sovereignty of monetary policy, with higher interest rates needed to contain inflation.</p><p >It said the long-term potential of cryptocurrencies being used for settlements was limited.</p><p >Meanwhile, the Bank of Russia is planning to issue its own digital rouble, joining the global trend to develop digital currencies to modernise financial systems, speed up payments and counter a potential threat from other cryptocurrencies.</p></div></iframe></div>",
  "image": "https://blogger.googleusercontent.com/img/a/AVvXsEh8Ab2fniYX1LMiTt-SPNcljyB-NxzIH1dlQTxEvcspfJZA-dwAY1rGM3kB4TV9RsJFUZg-x_0n7tfSr8j-WBwrBpsKE543Zdyd75jKXHVcGwSjeuqaueLN4BpkzkxjM3ik7yYdc9yCr_qRRy32QlvV9DtvFZefdtdqiYPTvpZHgVUVFKfbADao2NjVIQ=w640-h394",
  "description": "The latest tech news about the world's best (and worst) hardware, apps, games and Product Reviews much more. From top companies like Google and Apple.",
  "publisher": "Techcrunch",
  "publisherUrl": "https://www.techcrunch.com"
}