{
  "title": "Scientists scrutinise characteristics of new Omicron sub-variant",
  "url": "https://techncruncher.blogspot.com/2022/01/scientists-scrutinise-characteristics.html",
  "date": "Sun, 23 Jan 2022 11:57:00 +0000",
  "author": "noreply@blogger.com (Unknown)",
  "content": "<p><span >&nbsp;</span><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" ><tbody><tr><td ><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgJf6Hs9O_Kr8bWN0B0pAnWyYEVBMyRcxvXv3gocq9Mah8oBB7xVMSl0KpUpgsYzG8hmxRuT1qbkBYPfr-mPTI9yI3CpuBWkUYnOJ364HMnLzz1P08Aj2drFUo3tK_BYqNjUfS2S2UbToVyT9-vd9NlGiQIKdYIkknCRJmWVYh1Ae7bGKgf5nfzF8_W8w=s320\" imageanchor=\"1\" ><span ><img border=\"0\" data-original-height=\"180\" data-original-width=\"320\" height=\"360\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgJf6Hs9O_Kr8bWN0B0pAnWyYEVBMyRcxvXv3gocq9Mah8oBB7xVMSl0KpUpgsYzG8hmxRuT1qbkBYPfr-mPTI9yI3CpuBWkUYnOJ364HMnLzz1P08Aj2drFUo3tK_BYqNjUfS2S2UbToVyT9-vd9NlGiQIKdYIkknCRJmWVYh1Ae7bGKgf5nfzF8_W8w=w640-h360\" width=\"640\" /></span></a></td></tr><tr><td class=\"tr-caption\" ><span ><span >Image Credit:</span><span class=\"ArticleCaption__rights\" ><span >CIPhotos via Getty Images<span><a name='more'></a></span></span><span ></span></span></span></td></tr></tbody></table><span ><br /></span></p><p><strong><span >Studies are underway to find out the precise characteristics of the latest Covid-19 variant ‘BA.2’. It already accounts for the majority of most recent cases in a number of countries, including India, Denmark and Sweden. But, for French Health Minister Olivier Véran, this sub-variant’s arrival in France is not “a game changer”.</span></strong></p><p><span >BA.2, nicknamed “Omicron’s little brother”, made its first appearance in France a few weeks ago. Mentioned for the first time by&nbsp;<a href=\"https://www.france24.com/en/tag/olivier-v%C3%A9ran/\" rel=\"noopener\" target=\"_self\">Véran</a>&nbsp;during a press conference&nbsp;<a href=\"https://www.france24.com/en/france/20220120-france-says-will-loosen-covid-19-measures-from-february\" rel=\"noopener\" target=\"_self\">on January 20,</a>&nbsp;this new&nbsp;<a href=\"https://www.france24.com/en/tag/coronavirus/\" rel=\"noopener\" target=\"_self\">Covid-19</a>&nbsp;derivative is being scrutinised&nbsp;by scientists.</span></p><ul><li><h4><strong><span >Where does BA.2 come from? &nbsp;</span></strong></h4></li></ul><p><span >BA.2 was first identified in India and South Africa in late December 2021. It is a sub-variant, believed to have emerged from a mutation of Omicron (officially known as BA.1). Omicron itself was born from a mutation of Delta. Other sub-lineages have already been referenced, such as BA.3 or BB.2, but they have attracted less attention from epidemiologists because of the dramatic increase in cases of people who have contracted BA.2.</span></p><p><span >BA.2 has more than 20 mutations, about half of them in the spike protein. This is the famous protein that interacts with human cells and is the key to the virus entering the body.</span></p><ul><li><h4><strong><span >Is this sub-variant as dangerous as Omicron? &nbsp;</span></strong></h4></li></ul><p><span >The&nbsp;<a href=\"https://www.france24.com/en/tag/who/\" rel=\"noopener\" target=\"_self\">World Health Organization (WHO),</a>&nbsp;which had classified Omicron as a “variant of concern”, does not at this stage distinguish between it and its BA.2 sub-lineage. For his part, Véran said that “as far as we know at the moment, it corresponds more or less to the characteristics we know about Omicron”. It is not “a game changer” at this stage, added Véran in an attempt to reassure.</span></p><p><span >BA.2 is being closely studied by the scientific community, but there is as yet no precise data on its resistance to vaccines or the severity of the cases of Covid-19 it causes. Scientists are beginning to speak out on the subject, while remaining cautious.</span></p><p><span >Virologist Tom Peacock of Imperial College London tweeted that “very early observations from India and Denmark suggest there is no dramatic difference in severity compared to BA.1. This data should become more solid (one way or another) in the coming weeks.”</span></p><p><span >Peacock added that “there is likely to be minimal differences in vaccine effectiveness against BA.1 and BA.2. Personally, I’m not sure BA.2 is going to have a substantial impact on the current Omicron wave of the pandemic.</span></p><p><span >“Several countries are near, or even past the peak of BA.1 waves. I would be very surprised if BA.2 caused a second wave at this point. Even with slightly higher transmissibility this absolutely is not a Delta-Omicron change and instead is likely to be slower and more subtle,” he predicted.</span></p><p><span >For epidemiologist Antoine Flahault, director of the University of Geneva’s Institute of Global Health, infection monitoring should make it possible to test the resistance of BA.2, in particular if people infected with the classic Omicron are again contaminated with the sub-variant. However, it is necessary to have the means to detect contamination with BA.2 in the population, which seems delicate at this stage and which does not seem to be self-evident.</span></p><ul><li><h4><strong><span >Why is BA.2 so difficult to trace? &nbsp;</span></strong></h4></li></ul><p><span >BA.2 poses certain challenges to scientists, as it is not easy to track. A variation in PCR test protocols and the fact that the type of kit varies from one laboratory to another makes it difficult to reliably identify BA.2, according to Florence Débarre, a biologist at the Institute of Ecology and Environmental Sciences in Paris,&nbsp;<a href=\"https://www.liberation.fr/checknews/que-sait-on-du-variant-ba2-presente-comme-le-nouvel-omicron-20220120_M2N7VQUZM5ATNIJX3TTTDISE34/\" rel=\"noopener\" target=\"_blank\">interviewed by Libération</a>. “In the UK, the way the tests are carried out does not allow us to distinguish between BA.2 and Delta,” explains Débarre.</span></p><p><span >There is a more accurate but less commonly used tool for tracking variants: genetic sequencing of the virus. This allows the exact presence of this sub-variant to be identified. But in France, for example, only some of the laboratory tests are randomly subjected to this more in-depth and expensive form of analysis. Sequencing also has the drawback of being slow, which means it is not suitable for monitoring a rapidly spreading variant.</span></p><ul><li><h4><strong><span >Where is BA.2 most dominant?&nbsp;</span></strong></h4></li></ul><p><span >The sub-variant has been detected in at least 43 countries on all continents. It is believed to have become the most common variant in a number of countries, including India, Denmark and Sweden. In Denmark,&nbsp;the number of daily cases of Covid-19 has started to rise again, just when the Danes thought they had already reached the peak.</span></p><p><span >The UK Health Security Agency (UKHSA) identified more than 400 cases in Britain in the first 10 days of January.</span></p><p><span >“The Danish authorities have no explanation for this phenomenon, but it is being closely monitored,” said France’s public health agency, which is following the latest developments in Denmark. This “suggests that BA.2 is even more transmissible”, agreed Débarre. In Europe, BA.2 has also been sequenced in the UK, Germany, Belgium, Italy and France, while&nbsp;North America, Asia and Australia have recorded cases, too.</span></p><ul><li><h4><span >Is BA.2 evolving as fast in France?</span></h4></li></ul><p><span >To date, the sub-variant has been detected “at very low levels” in France, says France’s public health agency. “We have an international situation where the Omicron variant is circulating a lot, so it is normal that we observe sub-variants over time,” the agency said on January 21.</span></p><p><br /></p>",
  "image": "https://blogger.googleusercontent.com/img/a/AVvXsEgJf6Hs9O_Kr8bWN0B0pAnWyYEVBMyRcxvXv3gocq9Mah8oBB7xVMSl0KpUpgsYzG8hmxRuT1qbkBYPfr-mPTI9yI3CpuBWkUYnOJ364HMnLzz1P08Aj2drFUo3tK_BYqNjUfS2S2UbToVyT9-vd9NlGiQIKdYIkknCRJmWVYh1Ae7bGKgf5nfzF8_W8w=w640-h360",
  "description": "The latest tech news about the world's best (and worst) hardware, apps, games and Product Reviews much more. From top companies like Google and Apple.",
  "publisher": "Techcrunch",
  "publisherUrl": "https://www.techcrunch.com"
}