{
  "title": "Tonga struggles with ash, psychological trauma after eruption and tsunami",
  "url": "https://techncruncher.blogspot.com/2022/01/tonga-struggles-with-ash-psychological.html",
  "date": "Sun, 23 Jan 2022 12:24:00 +0000",
  "author": "noreply@blogger.com (Unknown)",
  "content": "<table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" ><tbody><tr><td ><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgfRv8ILMxFmieVisRl2O47YZXZSXL8d5YaMJS2kp_VTl5--faARbyQy5kZi_Uhr0qsbJzBwv5EXXHRZzuFz48gR8cFU1Hqu5K_ayILE2JTaprl0Ms1vOFDol314gVyTRnJsD2tCrycY7HKJlb9gfqOYh9PqKxR3gFYT89u62ovB8GMUWAAr0_DUQ0OEQ=s960\" imageanchor=\"1\" ><span ><img alt=\"A satellite image shows Mango islands\" border=\"0\" data-original-height=\"749\" data-original-width=\"960\" height=\"500\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgfRv8ILMxFmieVisRl2O47YZXZSXL8d5YaMJS2kp_VTl5--faARbyQy5kZi_Uhr0qsbJzBwv5EXXHRZzuFz48gR8cFU1Hqu5K_ayILE2JTaprl0Ms1vOFDol314gVyTRnJsD2tCrycY7HKJlb9gfqOYh9PqKxR3gFYT89u62ovB8GMUWAAr0_DUQ0OEQ=w640-h500\" title=\"A satellite image shows Mango islands\" width=\"640\" /></span></a></td></tr><tr><td class=\"tr-caption\" ><figure class=\"ArticleImage__figure___3YPsEY ArticleBody__element___3UrnEs\" data-testid=\"image-0\" ><figcaption class=\"Text__text___3eVx1j Text__medium-grey____X3zmS Text__regular___Bh17t- Text__small___MoVgdT Body__base___25kqPt Body__caption___1g8_ry ArticleImage__figcaption___2BB5sN\" ><span >A satellite image shows Mango islands after Hunga Tonga-Hunga Ha'apai volcano eruption, in Tonga, January 20, 2022. Satellite Image @2022 Maxar Technologies/Handout via REUTERS</span></figcaption><span><span ><a name='more'></a></span></span><div><div><span >Families have prevented children from playing outside as Tonga struggles to deal with the ash and&nbsp; psychological effects of last week's volcanic eruption and tsunami, aid workers and local residents said. Telephone service interrupted.&nbsp;</span></div><div><span ><br /></span></div><div><span >The Red Cross said it was providing 173 households on the main island of Tonga not only with tents, food, water and toilets&nbsp; but also comforts. \"Right now everyone is still having issues,\" said Drew Havea,&nbsp; vice president of the Tonga Red Cross.&nbsp;</span></div><div><span ><br /></span></div><div><span >Because of the ashes, \"families make sure their kids aren't playing outside, that everyone is inside,\" he said.&nbsp;</span></div><div><span ><br /></span></div><div><span >Although some residents of the hardest-hit Ha'apai outlying islands&nbsp; had been evacuated to the main island of Tongatapu, others refused to go, Havea said. The psychological effects of waves breaking through and destroying villages will affect their lives for some time, he said. “All the kids grew up, they were taught in their geography class that this is the ring of fire we&nbsp; all live in.&nbsp;</span></div><div><span ><br /></span></div><div><span >Now I think we're pretty worried and we're starting to think, 'How active are these places?he told Reuters. The eruption of HungaTongaHungaHa'apai volcano, which sits on the seismically active Pacific Ring of Fire, sent tsunami waves across the Pacific Ocean and was heard about 2,300 km (1,430 miles) away in New Zealand.</span></div><div><span ><br /></span></div><div><span >The eruption was so powerful that space satellites captured not only huge clouds of ash but also an atmospheric shockwave that radiated out from the volcano at close to the speed of sound.</span></div><div><span >\"I thought the world was ending,\" recalled John Tukuafu, owner of&nbsp; beach resort Vakaloa, who had to rush to save his wife from the tsunami.&nbsp;</span></div><div><span ><br /></span></div><div><span >The resort was in Kanokupolu, one of the worst-hit areas of Tongatapu. and uprooted trees and debris now lie in the area where the complex was located. it has taken a week for many people to recover from the \"throbbing and terrifying\" sound of the eruption, he said.</span></div><div><span >&nbsp;</span></div><div><span >\"It was too loud to hear, but I could feel it. Until the big bang,\" She told Reuters by phone on SundayResidents were wishing for tropical rain to wash off the \"awful and itchy\" volcanic dust, said Fonua. Leaves on trees had turned brown and were falling off.</span></div><div><span ><br /></span></div><div><span >Fonua said she was in her seafront office talking on the phone to her son in New Zealand when the tsunami struckWhen the line went dead, he feared she had been swept away.&nbsp;</span></div><div><span >The anxiety of many Tongan families overseas was prolonged in the days it took for limited international call capacity to be restored.</span></div><div><span ><br /></span></div><div><span >Cut off from the world, Tongans got on with immediate rescue efforts, Fonua said.</span></div><div><span >Older Tongans with a tradition of self-reliance remarked that young people had been forced to stop looking at their smart phones and had leapt into action, she said.</span></div><div><span ><br /></span></div><div><span >With power restored after a week, the Matangi Tonga website posted its first story on Saturday since the eruption and tsunami, describing the \"pumice rain\", as volcanic debris fell from the sky, and waves that engulfed cars.</span></div><div><span ><br /></span></div><div><span >Still, her office cannot send email and Tonga needs more satellite capacity, Fonua said.</span></div><div><span >The international navy ships and flights arriving had brought much needed supplies and communication equipment, she said.</span></div></div></figure></td></tr></tbody></table><br />",
  "image": "https://blogger.googleusercontent.com/img/a/AVvXsEgfRv8ILMxFmieVisRl2O47YZXZSXL8d5YaMJS2kp_VTl5--faARbyQy5kZi_Uhr0qsbJzBwv5EXXHRZzuFz48gR8cFU1Hqu5K_ayILE2JTaprl0Ms1vOFDol314gVyTRnJsD2tCrycY7HKJlb9gfqOYh9PqKxR3gFYT89u62ovB8GMUWAAr0_DUQ0OEQ=w640-h500",
  "description": "The latest tech news about the world's best (and worst) hardware, apps, games and Product Reviews much more. From top companies like Google and Apple.",
  "publisher": "Techcrunch",
  "publisherUrl": "https://www.techcrunch.com"
}