{
  "title": "Apple adds unlisted apps to its App Store",
  "url": "https://www.theverge.com/2022/1/30/22909367/apple-unlisted-apps-app-store",
  "date": "2022-01-30T23:06:57.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/ibsMizkQvVX5Qg4WRhy-_NqoFF0=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70451109/acastro_210831_1777_0002.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"J46PZ2\"><a href=\"https://developer.apple.com/support/unlisted-app-distribution/\">Apple will now let developers distribute unlisted apps</a> through the App Store that only users with a direct link can access (via <a href=\"https://www.macrumors.com/2022/01/28/app-store-unlisted-app-distribution/\"><em>MacRumors</em></a>). While unlisted apps aren’t discoverable by the general public through search results, App Store categories, charts, or recommendations, they’re available to administrators via the Apple Business Manager or Apple School Manager.</p><div class=\"c-float-right\"><aside id=\"F7ZbZm\"><q>Unlisted apps are ideal for “limited audiences”</q></aside></div><p id=\"Z5Fb5m\">Apple notes that unlisted apps are ideal for “limited audiences,” such as guests at a special event, members of an organization, research study participants, or a specific group of employees. To make an app unlisted and obtain a link, developers will first need to submit a request to Apple.</p><p id=\"zEHkxS\">Apps that have only been approved for private download on the Apple Business Manager or Apple School Manager require developers to take some extra steps, however. Apple says developers will need to “create a new app record in App Store” upload the binary, and then “set the distribution method to Public.” Developers with apps that are already public can submit a request without additional steps.</p><p id=\"mXFxGU\">Once Apple approves the request, the distribution method for the app will change to “Unlisted App,” and the same goes for any updated versions of that app. If the app is already available on the App Store, the link for the now-unlisted app will stay the same. It’s also important to note that unlisted apps “must be ready for final distribution” and Apple won’t approve any apps still in beta or a pre-release state.</p><p id=\"UVZnlv\">A somewhat similar policy under the <a href=\"https://developer.apple.com/programs/enterprise/\">Developer Enterprise Program</a>, which was originally put in place for developers to test and internally distribute apps before they’re officially reviewed by Apple, <a href=\"https://www.theverge.com/2019/2/20/18232583/apple-ios-developer-enterprise-program-store-mobile-apps\">saw bad actors use the program to sidestep</a> Apple’s rigorous safety requirements. This led to the shadowy presence of <a href=\"https://www.theverge.com/2019/2/20/18232140/apple-tutuapp-piracy-ios-apps-developer-enterprise-program-misuse\">pirated games, gambling, and porn apps</a> that could be easily sideloaded onto iPhones. It’s unclear how rigorous the review process will be for unlisted apps, but findings from <a href=\"https://arstechnica.com/gadgets/2022/01/apple-now-allows-unlisted-apps-on-the-app-store/\"><em>Ars Technica</em></a> suggest it will be reserved for apps with a limited audience only.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/4AksjaM_7Q3H_IuoLv3MNC0vcHg=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22817753/acastro_210831_1777_0002.jpg",
  "description": "Unlisted apps won’t be discoverable in the App Store.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}