{
  "title": "Galaxy S22: What to expect from Samsung’s February Unpacked",
  "url": "https://www.theverge.com/2022/1/26/22902649/samsung-galaxy-s22-unpacked-event-tab-s8-home-mini-2-date",
  "date": "2022-01-29T16:54:14.000Z",
  "author": "Jon Porter",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/-xzk88P9rtvZJ4402EHgGfTTVJ0=/15x0:1065x700/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70435887/s22U.0.jpg\" />        <figcaption><em>A leaked image, apparently of Samsung’s Galaxy S22 Ultra.</em> | Image: <a class=\"ql-link\" href=\"https://twitter.com/evleaks/status/1476660792527306754\" target=\"_blank\">evleaks (Twitter)</a></figcaption>    </figure>  <p>The Galaxy S22 will likely be the main event, but what else could there be?</p> <p id=\"qy1Ujw\">Another Samsung launch event is nearly upon us. The South Korean tech giant has announced that its next Unpacked event will take place<a href=\"https://www.theverge.com/2022/1/25/22900900/samsung-galaxy-unpacked-february-date-time-s22\"> on February 9th</a>, during which we’re expecting to see the official announcement of the Galaxy S22, its latest flagship phone series. Samsung’s Galaxy S devices are typically its highest-specced non-folding phones, and they’re typically our first look at trends major smartphone manufacturers will be following for the year.</p><p id=\"yOThjT\">This being Samsung, however, it’s unlikely that phones will be the only thing announced on the 9th. Recent rumors suggest they’re likely to be joined by a new lineup of Galaxy Tab S8 tablets, which would both succeed the Tab S7 devices <a href=\"https://www.theverge.com/2020/8/5/21354933/samsung-galaxy-tab-s7-plus-tablets-120hz-oled-price-specs-features\">that debuted in 2020</a> as well as adding a new, larger “Ultra” branded tablet into the mix. There are even <a href=\"https://www.mysmartprice.com/gear/samsung-galaxy-home-mini-2-bluetooth-sig-certification/\">rumblings of a new smart speaker</a> known as the Galaxy Home Mini 2, whose <a href=\"https://twitter.com/MaxJmb/status/1481342345727594499\">production is rumored to have recently started</a>. </p><p id=\"hmIa6A\">Read on for a complete rundown of everything we’re expecting.</p><h2 id=\"J7nNiR\">The Galaxy S22 series</h2><p id=\"N7UKcU\">A new year brings with it a new lineup of flagship Samsung Galaxy S smartphones, which this year is expected to consist of three devices: the Galaxy S22, Galaxy S22 Plus, and Galaxy S22 Ultra. And thanks to <a href=\"https://winfuture.de/news,127716.html\">detailed leaks from <em>WinFuture</em></a> and <a href=\"https://twitter.com/dohyun854/status/1487158345077182464?s=20&amp;t=oREDQwgbtlzvR5lNN6RCWg\">tipster Dohyun Kim</a>,<em> </em>we have a very good idea of what their specs are likely to be. In the US, all three of them will reportedly ship with Qualcomm’s latest flagship processor, the Snapdragon 8 Gen 1, while Europe will likely get devices powered by Samsung’s own <a href=\"https://www.theverge.com/2022/1/17/22888966/samsung-exynos-2200-soc-chip-announced-amd-gpu-rdna-2\">Exynos 2200 processor</a> — notable for being the first smartphone chip with AMD graphics in over a decade, ever since Qualcomm bought <a href=\"https://en.wikipedia.org/wiki/Imageon#cite_note-Ferguson-5\">AMD / ATI’s Imageon division</a> and turned it into Qualcomm Adreno graphics.</p><p id=\"F7sGUH\">The new Samsung phones will reportedly all feature ultrasonic in-display fingerprint sensors, although apparently, once again, only the Plus and Ultra will get UWB support to offer full compatibility with <a href=\"https://www.theverge.com/2021/4/8/22373410/samsung-galaxy-smarttag-plus-uwb-ar-bluetooth-price-release-date\">Samsung’s Galaxy SmartTag Plus trackers</a>.</p><p id=\"a2ZJ4o\">The S22 and S22 Plus appear to be straightforward updates of the S21 and S21 Plus, with both featuring very similar designs to last year’s models. That means both should have 2021’s new design language with camera bumps neatly integrated into the top left corner of the back of the phone, as well as flat displays featuring centrally orientated hole-punch notches for their selfie cameras. </p><p id=\"plen8C\">According to <em>WinFuture, </em>they also include 120Hz OLED displays that are both 0.1 inches smaller than last year (at 6.1 and 6.6 inches, respectively) but feature higher peak brightness of 1,500 nits and 1,750 nits, up from 1,300 nits last year. The handsets themselves are around 5mm shorter than last year’s models and also appear to be a hair thinner. Rated battery capacity is reportedly a little lower this year at 3,700mAh and 4,500mAh, respectively, so it’ll be interesting to see what impact this has on battery life.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/VByym804d4egDMFQFYRbmehSH4o=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23196424/S22.jpg\">      <cite>Image: <a class=\"ql-link\" href=\"https://winfuture.de/news,127716.html\" target=\"_blank\"><em>WinFuture</em></a></cite>      <figcaption><em>A leaked image of what’s claimed to be the Galaxy S22.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/tNa34hfZIFXLaopPSEAu4LP5pcg=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23196426/S22_Plus.jpg\">      <cite>Image: <a class=\"ql-link\" href=\"https://winfuture.de/news,127716.html\" target=\"_blank\"><em>WinFuture</em></a></cite>      <figcaption><em>And the S22 Plus.</em></figcaption>  </figure></div><p id=\"wLe0U0\">When the rear of the non-Ultra phones is revealed, we’re expecting to see two very similar-looking camera bumps, each containing three cameras. But their specs could be very different from what we saw last year, with much higher resolution main cameras but lower resolution telephotos. This year, <em>WinFuture</em> reports we’ll see both phones ship with 50-megapixel main cameras, paired with 12-megapixel ultrawides, and 10-megapixel telephotos. Other specs like aperture are broadly similar, although the main 50-megapixel sensor has gotten a size increase to 1/1.56” (up from 1/1.76” last year), while the sensor behind the telephoto lens is reportedly much smaller at 1/3.94” (down from 1/1.72”)</p><p id=\"o5ofq2\">This larger main sensor may explain why Samsung is promising that these phones will let you “own the night” and take “the best and brightest photos and videos you’ve ever captured with a phone.”</p><p id=\"d1y5Wy\">Both phones will reportedly have 8GB of RAM and offer a choice of 128 or 256GB of storage, just like last year. Available colors include black, white, pink gold, and green, according to <em>WinFuture.</em></p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/o3mAkPbNeSPzxj6CG0786ZH3BQI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23135171/s22U.jpg\">      <cite>Image: <a class=\"ql-link\" href=\"https://twitter.com/evleaks/status/1476660792527306754\" target=\"_blank\">evleaks (Twitter)</a></cite>      <figcaption><em>A leaked image of what will likely be the Galaxy S22 Ultra.</em></figcaption>  </figure></div><p id=\"4sZ4mJ\">While the S22 and S22 Plus appear to be an iterative update over their predecessors, the S22 Ultra will reportedly be a very different beast. Rather than using a similar design language to the rest of the S22 lineup, like the <a href=\"https://www.theverge.com/22241506/samsung-galaxy-s21-ultra-review-camera-price\">S21 Ultra</a> did for the <a href=\"https://www.theverge.com/22252460/samsung-galaxy-s21-review-price-camera-processor\">S21</a>, <a href=\"https://www.theverge.com/2021/12/30/22860479/samsung-galaxy-s22-ultra-leak-official-image-note-design\">leaked renders</a> suggest the S22 Ultra will have a very similar squared-off design to Samsung’s previous Note devices. There’s reportedly even a built-in slot for its S-Pen stylus this time around, which replaces <a href=\"https://www.theverge.com/2021/1/14/22226594/samsung-galaxy-s21-ultra-s-pen-stylus-support-price-unpacked-event\">the case holder Samsung sold</a> for the phone last year. </p><div class=\"c-float-right c-float-hang\"><aside id=\"j5p8m2\"><q>The Note is now Ultra</q></aside></div><p id=\"Hq9BFE\">Samsung has even alluded to this change itself, teasing that it plans to announce its “<a href=\"https://news.samsung.com/us/editorial-setting-new-standard-smartphones-in-changing-world/?utm_source=pr&amp;utm_medium=email&amp;utm_campaign=general\">most noteworthy S series ever</a>” during the upcoming event. After the company skipped releasing a new Galaxy Note phone entirely last year, it now appears to be integrating its features into its most premium Galaxy S device instead.</p><p id=\"eZcJKc\">As for the device’s specs, <em>WinFuture </em>has the rumored details once again. From the looks of things, despite the radically different design, the S22 Ultra appears to be a very similarly specced device to its predecessor. It apparently has the same size screen (6.8 inches), the same size battery (5,000mAh), the same exact weight and thickness at 8.9mm and 227g, respectively, and even the same camera resolutions (108-megapixel main, 12-megapixel ultrawide, and two 10-megapixel telephotos with 3x and 10x zoom) and apertures. You’ll reportedly still have a choice of 128, 256, or 512GB of storage, but it looks like your RAM options might be limited to 8 or 12GB, rather than 12 and 16GB like with the S21 Ultra. As well as the black, white, and green color options, the S22 Ultra will reportedly also be available in burgundy.</p><p id=\"kkRRXs\">Its camera specs might not be exactly the same, judging by the smaller sensor size <em>WinFuture</em> lists for its two 10-megapixel telephoto cameras. But these leaks, if accurate, suggest the Galaxy S22 Ultra may feel very familiar despite its radically different looks.</p><p id=\"lTldTP\">Finally, in terms of pricing (at least in Europe), the S22 will reportedly start at €849 (around $958), rising to €1,049 (around $1,183) for the S22 Plus and €1,249 (around $1,409) for the S22 Ultra, according to <em>WinFuture</em>, which also lists a potential ship date of February 25th.</p><h2 id=\"3pDsCh\">The Galaxy Tab S8 series</h2><p id=\"CgEHJN\">While Samsung’s new Galaxy S smartphones could be its most “noteworthy” ever, the company is no doubt hoping that its new lineup of tablets will be a <em>notch</em> above the rest (ahem). Its new Tab S8 lineup has been heavily rumored in recent months, although it hasn’t been confirmed that they’ll definitely appear at the same launch event as the Galaxy S22.</p><p id=\"64WHig\">Rumors, including what seems to be <a href=\"https://twitter.com/dohyun854/status/1487316810940641281?s=20&amp;t=GP7HvTiLaELJaP7zrxkTQw\">the Unpacked launch video for the Tab S8 </a>(not to mention an <a href=\"https://www.theverge.com/2022/1/19/22890937/samsung-galaxy-tab-s8-ultra-tablet-android-leak\">image that appeared on Samsung’s own website</a>), suggest the company’s new flagship tablet could adopt a similar display notch to the one it <a href=\"https://www.theverge.com/2017/11/6/16611758/samsung-mocks-iphone-x-commercial\">mocked Apple for, including</a> on the iPhone X. The notch is rumored to be coming to a new Ultra tier in its Tab S8 lineup, <a href=\"https://winfuture.de/news,127516.html\">according to <em>WinFuture</em></a>, and it will reportedly sit above the Tab S8 and Tab S8 Plus in the company’s 2022 Android tablet lineup. </p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/oNxNxrJX0LwaOIqbr68qpW8kpbI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23196478/Samsung_Galaxy_Tab_S8_1642147299_0_12.jpg\">      <cite>Image: <a class=\"ql-link\" href=\"https://winfuture.de/news,127516.html\" target=\"_blank\"><em>WinFuture</em></a></cite>      <figcaption><em>The Galaxy Tab S8 Plus.</em></figcaption>  </figure>  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/7yQTjt0Z3Ngy8XFprdpVwkSlS3U=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23196477/Samsung_Galaxy_Tab_S8_Ultra_1642147327_0_12.jpg\">      <cite>Image: <a class=\"ql-link\" href=\"https://winfuture.de/news,127516.html\" target=\"_blank\"><em>WinFuture</em></a></cite>      <figcaption><em>The Galaxy Tab S8 Ultra, with its small display notch.</em></figcaption>  </figure></div><p id=\"3aUqCm\">Although the three tablets will reportedly be powered by Qualcomm’s latest Snapdragon 8 Gen 1 processor, screen sizes differ, ranging from 11 inches with the base Tab S8 through to 12.7 inches for the Tab S8 Plus and 14.6 inches for the Tab S8 Ultra. All three are 120Hz, but only the Plus and Ultra have OLED panels. The Ultra also benefits from a second 12-megapixel selfie camera (hence the notch), although at this point, it’s not clear what purpose this additional sensor could serve.</p><p id=\"LLUW1S\">Other features mooted for the Tab S8 series include 5G, S Pen, and wireless DeX support, as well as Dolby Atmos-compatible speakers. Pricing is less certain, but <em>WinFuture</em> notes it could range from as low as €680 (around $767) for the Tab S8, through to €1,220 (around $1,377) or more for the Tab S8 Ultra.</p><h2 id=\"Aa2rRh\">The Galaxy Home Mini 2, maybe?</h2><p id=\"UHE7H5\">OK, bear with me here. It doesn’t seem very likely that Samsung will announce a follow-up to the Bixby smart speaker it released in South Korea and nowhere else in 2020. But recently, <a href=\"https://www.mysmartprice.com/gear/samsung-galaxy-home-mini-2-bluetooth-sig-certification/\"><em>MySmartPrice </em>reports</a> that a new entry for a “Samsung SmartThings Home Hub” has appeared on the Bluetooth SIG certification website. </p><p id=\"sLdLDB\">Although the entry doesn’t appear to carry the “Galaxy Home” branding, its SM-V320 model number has previously been linked to the rumored smart speaker in a <a href=\"https://www.sammobile.com/news/samsungs-galaxy-home-mini-2-you-might-never-buy/\">November report from <em>SamMobile</em></a>. And according to <a href=\"https://twitter.com/MaxJmb/status/1481342345727594499\">tipster Max Jambor</a>, the speaker went into production earlier this month. There aren’t too many details on what form it could take, but <em>SamMobile</em> notes that there’s a chance it might be equipped with a display. </p><p id=\"uRdpdd\">Honestly, announcing a follow-up to a South Korean-exclusive smart speaker, which itself was a scaled-down model of another smart speaker that famously <a href=\"https://www.theverge.com/2020/2/14/21136224/samsung-galaxy-home-bixby-not-released\"><em>never shipped</em></a>, would be a pretty bold move from Samsung — even more so if it insisted on equipping it with its <a href=\"https://www.theverge.com/2019/12/20/21029499/decade-fails-flops-tech-science-culture-apple-google-data-kickstarter-2010-2019\">much-derided voice assistant</a>. But hey, stranger things have happened.</p><div class=\"c-wide-block\">  <figure class=\"e-image\">        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/uW-jUwBolicntIHlis9vShGCUfo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/11960503/cwelch180809_2812_3912.jpg\">      <cite>Photo by Chris Welch / The Verge</cite>      <figcaption><em>Gone but not forgotten, the original (unreleased) Galaxy Home.</em></figcaption>  </figure></div><p id=\"yHkkjA\"><strong>Update January 29th 11:45AM ET: </strong>Updated to add links to leaked spec sheets for the Tab S8 and Galaxy S22 from tipster Doyhun Kim, as well as what appears to be a leaked Unpacked launch video for the Tab S8.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/ZO8GWpEkLDUQF6Zz6qzAizh8XHQ=/0x68:1080x633/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23135171/s22U.jpg",
  "description": "What’s in store?",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}