{
  "title": "Here is the Spotify COVID content policy that lets Joe Rogan slide",
  "url": "https://www.theverge.com/2022/1/28/22907069/spotify-joe-rogan-neil-young-covid-19-moderation-policies",
  "date": "2022-01-30T20:53:43.000Z",
  "author": "Ashley Carman",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/MR0ndmSyoUE0_99stQ7nxSOGJ-U=/411x0:1899x992/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70445896/Screen_Shot_2020_05_21_at_10.07.14_AM.0.png\" />        <figcaption>Image: Joe Rogan</figcaption>    </figure>  <p id=\"KHSnmd\"><em><strong>Update January 30th, 3:50PM ET:</strong></em><em> After this post was published, </em><a href=\"https://www.theverge.com/2022/1/30/22909432/spotify-covid-19-moderation-joe-rogan-vaccine-misinformation\"><em>Spotify CEO Daniel Ek announced that Spotify is publicly posting its Platform Rules</em></a><em>, and that it will “add a content advisory to any podcast episode that includes a discussion about COVID-19.”</em></p><p id=\"y1ak1T\">Spotify employees are vocally upset inside the company over the streaming platform’s deal with Joe Rogan due to his views on COVID vaccines, but their executive leadership has mostly stayed quiet both inside and outside the firm. Today, however, Dustee Jenkins, Spotify’s head of global communications and public relations, posted a message to the company Slack addressing employee concerns about Joe Rogan’s presence on the platform after Neil Young <a href=\"https://www.theverge.com/2022/1/26/22903354/spotify-joe-rogan-removing-neil-young-music\">removed his music</a> in protest.</p><p id=\"K35Hky\">In screenshots viewed by <em>The Verge</em>, Jenkins said she “lead[s] Public Affairs” and that the company has reviewed multiple controversial <em>Joe Rogan Experience</em> episodes and determined they “didn’t meet the threshold for removal.” She adds that Spotify employs an “internal team of some of the best experts in the space” and also works with third parties who “advise us and help us evolve our policies given what’s going on in the world around us.”</p><p id=\"yJj9ag\">She added: “What Spotify hasn’t done is move fast enough to share these policies externally, and are working to address that as soon as possible.” </p><p id=\"1SpIyg\">The message also links to an internal company content guidelines page, which <em>The Verge </em>has viewed. Jenkins said these rules have been in place “for years.” The entire healthcare guidelines section is reproduced below. It prohibits:</p><blockquote><p id=\"HzJlFq\"><strong>Content that promotes dangerous false or deceptive content about healthcare that may cause offline harm and/or pose a direct threat to public health </strong>such as:</p><p id=\"d8P6QH\">Denying the existence of AIDS or COVID-19</p><p id=\"bpyUXH\">Encouraging the deliberate contracting of a serious or life threatening disease or illness</p><p id=\"y3Xo8K\">Suggesting that consuming bleach can cure various illnesses and diseases</p><p id=\"5tBD5S\">Suggesting that wearing a mask will cause the wearer imminent, life-threatening physical harm</p><p id=\"URH6pu\">Promoting or suggesting that the vaccines are designed to cause death</p></blockquote><div class=\"c-float-right\"><div id=\"JH7QSS\"><div data-anthem-component=\"aside:1522405\"></div></div></div><p id=\"tf73Mv\">These guidelines seemingly allow podcasters to say the vaccines cause death — just not that they are <em>designed</em> to cause death. Similarly, they allow podcasters to say wearing a mask is ineffective, just not that wearing masks will cause imminent, life-threatening harm. </p><p id=\"c9JiKt\"><em>The Verge</em> has reached out for comment on Jenkins’ statement, the content policy, and when Spotify plans to publicize this policy and hasn’t heard back.</p><p id=\"Esaeds\">“We apply our policies consistently and objectively,” Jenkins wrote. “They are not influenced by the media cycle, calls from any one individual or from external partners. It doesn’t mean I personally agree with this content. But I trust our policies and the rationale behind them.”</p><p id=\"yauzUr\">“Every creator must abide by our policies,” she added. </p><aside id=\"ygvEdv\"><div data-anthem-component=\"newsletter\" data-anthem-component-data='{\"slug\":\"podcasts\"}'></div></aside><hr class=\"p-entry-hr\" id=\"AwF0zC\"><h2 id=\"nmb9dr\">Related:</h2><div id=\"lY3KDe\"><div data-analytics-viewport=\"video\" data-analytics-action=\"volume:view:article:middle\" data-analytics-label=\"Why Spotify bought Joe Rogan’s podcast|76039\" data-volume-uuid=\"59ce4c7f8\" data-volume-id=\"76039\" data-analytics-placement=\"article:middle\" data-volume-placement=\"article\" data-volume-autoplay=\"false\" id=\"volume-placement-444\" class=\"volume-video\"></div></div>",
  "image": "https://cdn.vox-cdn.com/thumbor/rGMJy91QaTwVlZze0cA_BrEhsvk=/33x0:1928x992/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19991608/Screen_Shot_2020_05_21_at_10.07.14_AM.png",
  "description": "Spotify says it’s reviewed every Rogan episode and none \"meet the threshold for removal.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}