{
  "title": "Joni Mitchell removes music from Spotify in protest of Joe Rogan’s podcast",
  "url": "https://www.theverge.com/2022/1/29/22907696/joni-mitchell-spotify-joe-rogan-podcast-misinformation-covid-19",
  "date": "2022-01-29T15:51:29.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"Joni Mitchell Live\" src=\"https://cdn.vox-cdn.com/thumbor/2qdHSAhoeOaS7GDyKwAz1IwGIE4=/0x1:3000x2001/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70447606/483251731.0.jpg\" />    </figure>  <p id=\"0p3B45\"><a href=\"https://jonimitchell.com/news/newsitem.cfm?id=1592\">Joni Mitchell has decided to remove</a> all of her music from Spotify, <a href=\"https://www.theverge.com/2022/1/25/22900437/neil-young-spotify-joe-rogan-vaccine-misinformation\">joining Neil Young in protest</a> of Joe Rogan’s podcast that Young says spreads misinformation about the COVID-19 vaccines (via <a href=\"https://www.wsj.com/articles/joni-mitchell-removes-music-from-spotify-in-support-of-neil-young-against-joe-rogan-11643430456\"><em>The Wall Street Journal</em></a>).</p><div class=\"c-float-right\"><aside id=\"36gHJp\"><q>“I stand in solidarity with Neil Young and the global scientific and medical communities on this issue”</q></aside></div><p id=\"6aSQcp\">“I’ve decided to remove all my music from Spotify,” The Canadian singer-songwriter writes in a post on her website. “Irresponsible people are spreading lies that are costing people their lives. I stand in solidarity with Neil Young and the global scientific and medical communities on this issue.”</p><p id=\"g32WoB\">Mitchell also <a href=\"https://spotifyopenletter.wordpress.com/2022/01/10/an-open-letter-to-spotify/\">includes a link</a> to an open letter to Spotify, which was signed by dozens of medical and scientific professionals in mid-January. It urges the platform to establish a misinformation policy to address the “misleading and false claims” propagated by the <em>Joe Rogan Experience</em>, such as Rogan’s suggestion that <a href=\"https://www.theverge.com/2021/4/27/22406315/joe-rogan-vaccine-spotify-podcast-covid-19\">healthy young people shouldn’t get vaccinated</a> against COVID-19.</p><p id=\"LSVgqZ\">Earlier this week, Young gave Spotify an ultimatum: keep his music or Rogan’s podcast. <a href=\"https://www.theverge.com/2022/1/26/22903354/spotify-joe-rogan-removing-neil-young-music\">Spotify ended up favoring Rogan</a>, and in line with Young’s wishes, the platform pulled all of his music. <a href=\"https://www.theverge.com/2022/1/28/22906722/neil-young-spotify-sound-quality-amazon-apple-music\">Young later said he “felt better” after getting his music removed</a>, and then criticized Spotify for <a href=\"https://www.theverge.com/2021/12/23/22851667/spotify-hifi-lossless-hi-fi-streaming\">failing to offer lossless audio</a>, an option that both Amazon and Apple Music provide. Apple has even been using Young’s departure from Spotify as an opportunity to <a href=\"https://www.theverge.com/2022/1/28/22906063/spotify-neil-young-apple-music-joe-rogan-feud\">take numerous digs at its competitor</a>, going so far as to <a href=\"https://twitter.com/AppleMusic/status/1486863052180004867\">label Apple Music</a> as “the home of Neil Young.”</p><p id=\"j6cS5A\">In 2020, <a href=\"https://www.theverge.com/2020/5/19/21263927/joe-rogan-spotify-experience-exclusive-content-episodes-youtube\">Spotify made the <em>Joe Rogan Experience</em> exclusive</a> to the platform, and it has since come under fire for <a href=\"https://www.theverge.com/2021/12/7/22821823/joe-rogan-media-matters-hot-pod-spotify-moderation\">Rogan’s potentially misleading comments</a> about COVID-19 and its vaccines. As it stands, it appears Spotify’s content policies prevent the platform from doing anything about Rogan’s podcast. In <a href=\"https://www.theverge.com/2022/1/28/22907069/spotify-joe-rogan-neil-young-covid-19-moderation-policies\">internal guidelines seen by <em>The Verge</em></a>, its policies seem to allow podcasters to state COVID-19 vaccines can cause death, but not that they’re “designed” to cause death. A screenshot of an internal message also viewed by <em>The Verge</em> reveals Spotify has reviewed numerous controversial episodes of the <em>Joe Rogan Experience</em>, and none “meet the threshold for removal.”</p><p id=\"ZzVzCj\"><em>The Verge</em> reached out to Spotify with a request for comment but didn’t immediately hear back.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/RXd68GxU1Qwqh3v1Dh3vnl65hLY=/0x216:3000x1787/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23203466/483251731.jpg",
  "description": "Mitchell says she stands \"in solidarity with Neil Young.\"",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}