{
  "title": "Life360 is getting out of the business of selling precise user location data",
  "url": "https://www.theverge.com/2022/1/28/22906392/life360-tile-location-data-precise-aggregated-privacy",
  "date": "2022-01-29T00:07:36.000Z",
  "author": "Umar Shakir",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/TOqhLplG7VpoMKVTqERWPRMeE9k=/1x0:919x612/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70446222/Screen_Shot_2022_01_28_at_4.13.43_PM.5.png\" />        <figcaption>Image: Google</figcaption>    </figure>  <p id=\"BT9RTq\">Life360, a safety and tracking service that helps its users to keep tabs on the whereabouts of family and friends who also use the app, is scaling back its user data sales business to just two partners: Allstate Arity and Placer.ai (<a href=\"https://themarkup.org/privacy/2022/01/27/life360-says-it-will-stop-selling-precise-location-data\"><em>via The Markup</em></a>). This news comes after the company <a href=\"https://www.theverge.com/2021/11/22/22797559/tile-bluetooth-tracker-location-gps-acquisition-life360\">announced a deal to acquire the item tracker Tile in November</a> and a December <a href=\"https://themarkup.org/privacy/2021/12/06/the-popular-family-safety-app-life360-is-selling-precise-location-data-on-its-tens-of-millions-of-user\">report</a> from <em>The Markup </em>said Life360 was the source of <a href=\"https://www.theverge.com/2021/12/9/22820381/tile-life360-location-tracking-data-privacy\">precise location data</a> to as many as a dozen data brokers. That report cited sources within the industry who called Life360 one of the largest sources of data.</p><div class=\"c-float-right\"><aside id=\"Dj1xL9\"><q>Life360 says Tile data will “never” be monetized or sold</q></aside></div><p id=\"GRWtk0\">At the time, CEO Chris Hulls pushed back on that assertion, saying that “with approximately 30 million active users, we account for a very small portion of the overall market,” while acknowledging that its data sales brought in about $16 million in 2020. <em>The Markup </em>reported that represented about 20 percent of its overall revenue for the year, even before including $6 million made from its partnership with Allstate Arity. For 2021, the company reported 42 percent revenue growth year-on-year, which included the previous data collection business contracts.</p><div id=\"4CBhyr\"><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">Life360 was one of the multibillion-dollar location data industry’s largest raw data sources.<br><br>Now, it says it’ll instead sell aggregated user data to one location data firm: Placer․ai.<a href=\"https://twitter.com/alfredwkng?ref_src=twsrc%5Etfw\">@alfredwkng</a> and <a href=\"https://twitter.com/jonkeegan?ref_src=twsrc%5Etfw\">@jonkeegan</a> break down the scope of this change.<a href=\"https://t.co/g8iIDQ2o9L\">https://t.co/g8iIDQ2o9L</a></p>— The Markup (@themarkup) <a href=\"https://twitter.com/themarkup/status/1486828977037758466?ref_src=twsrc%5Etfw\">January 27, 2022</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div><p id=\"MKuwgS\">Life360 has a new data collection deal with Placer.ai, which the company says is the start of its exit from the “traditional” data broker business, which will only include “aggregated analytics” that it says will help retail businesses understand customers better. From Life360’s <a href=\"https://s3.documentcloud.org/documents/21190590/life360-december-2021-quarterly-activities-report.pdf\">quarterly activity report</a> released yesterday:</p><blockquote><p id=\"Vf0dYq\">With this agreement, Placer.ai will provide critical data insights and analytics services to Life360, which will enhance the product experience for our users. As part of this partnership, Placer will have the right to commercialise solely aggregated data related to places visits during the term of the agreement. We have begun terminating our relationships with all other location data partners with the exception of Allstate/Arity, which will continue.</p><p id=\"Y3g08i\">Life360 recognises that aggregated data analytics (for example, 150 people drove by the supermarket) is the wave of the future and that businesses will increasingly place a premium on data insights that do not rely on device-level or other individual user-level identifiers. As a result, we believe this partnership will enable us to spend less time navigating the rapidly evolving regulatory and platform environment, while simultaneously reducing business risk. </p><p id=\"QX1hXg\">This agreement includes a minimum revenue guarantee based on the size of Life360’s active user base, which we expect will preserve revenue in-line with CY21 results for the duration of the three-year agreement. Life360 will also be receiving a 10 year warrant exercisable to purchase up to US$25m in Placer.ai, which recently completed a US$100m capital raise. The agreement also expressly excludes </p><p id=\"hVsONS\">Tile and Jiobit device data to underscore our clear message that data from Tile and Jiobit devices is not, and will never be, sold or monetised.”</p></blockquote><p id=\"M11GZU\">We asked Life360 CEO Chris Hulls in December what his company would do if its (soon to be ex-) partners, like X-mode or Cuebiq, did sell identifiable data to the government — and Hulls responded saying partners would be sued for breaching their contract.</p><p id=\"dSa2lX\">Allstate Arity is the second of the two exceptions in Life360’s scaling back of location tracking. Functionally, Allstate would need to know how fast the device in a car is traveling, calculate the G-forces of an accident, and ultimately signal back the location of the crash to authorities for the safety features to work. How it will use the trip information for data insights other than driver safety remains to be seen.</p><p id=\"O78xT0\">User participation in sharing their aggregated data to Placer.ai is optional, however, it will remain as an opt-out action in the app's settings.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/QGTUI47BLTIWhwhWfKWT9yZP2AY=/0x65:920x547/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23202769/Screen_Shot_2022_01_28_at_4.13.43_PM.png",
  "description": "Tile’s new owner Life360 blinks on user data sales.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}