{
  "title": "T-Mobile will reportedly fire corporate employees who aren’t fully vaccinated by April 2nd",
  "url": "https://www.theverge.com/2022/1/29/22908070/t-mobile-fire-unvaccinated-corporate-employees-covid-19-vaccine",
  "date": "2022-01-29T20:53:42.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/IJKPJc8TvwIfzJIERgVpvjJMRkM=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70448319/acastro_191108_1777_t-mobile_0002.0.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"1Ua4sH\">T-Mobile will fire corporate employees who aren’t fully vaccinated against COVID-19 by April 2nd, according to <a href=\"https://www.bloomberg.com/news/articles/2022-01-29/t-mobile-to-fire-corporate-staff-who-don-t-get-vaccine-by-april\">an internal email viewed by <em>Bloomberg</em></a>. T-Mobile’s head of human resources, Deeanne King, reportedly says employees who’ve only received one dose as of February 21st will be put on unpaid leave.</p><div class=\"c-float-right\"><aside id=\"NMFTej\"><q>There will be “limited” exceptions for certain employees</q></aside></div><p id=\"U0zWIv\">“T-Mobile’s badge-controlled offices continue to be accessible only to those who are vaccinated against COVID-19,” T-Mobile said in a statement to <em>The Verge</em>, referencing the digital pass system the company uses to keep track of employees’ vaccination status. “We have shared with employees that we are requiring office workers to be fully vaccinated by April 2.” The mobile carrier also stated there will be “limited” exceptions “for certain roles, locations and legally mandated accommodations and exemptions.”</p><p id=\"fG8FKy\">As pointed out by <em>Bloomberg</em>, the policy applies to corporate employees who regularly or occasionally work in the office. Customer service employees will reportedly need to show proof they received the first dose of a vaccine by February 21st, but won’t be put on unpaid leave for failing to do so. <em>Bloomberg</em> also notes technicians and store employees won’t be subject to the mandate, although the company still encourages vaccination and frequent testing.</p><p id=\"Wk25F4\">“We understand that this is a deeply personal decision for some employees but we believe that taking this step will put us in the best position to protect our T-Mobile community,” T-Mobile explained to <em>The Verge</em>.</p><p id=\"3L6oEg\">T-Mobile is far from the first tech company to require vaccinations against COVID-19, despite <a href=\"https://www.cnbc.com/2022/01/13/supreme-court-ruling-biden-covid-vaccine-mandates.html\">the Supreme Court blocking President Joe Biden’s vaccine mandate</a> for large employers. <a href=\"https://www.theverge.com/2021/12/14/22836575/google-unvaccinated-employees-mandate-unpaid-leave-termination-remote-work\">Google gave employees until January 13th</a> to show proof of vaccination or submit an exemption, or else face 30 days of administrative leave, followed by six months of unpaid leave and termination if they still aren’t in compliance. <a href=\"https://www.theverge.com/2021/12/21/22849074/intel-unvaccinated-employees-unpaid-leave\">Intel has also told employees</a> it will place them on unpaid leave if they aren’t vaccinated by January 4th, while both <a href=\"https://www.theverge.com/2022/1/10/22877332/meta-facebook-require-employees-covid-19-booster-vaccine-shot-return-office-reopening\">Meta</a> and <a href=\"https://www.theverge.com/2022/1/15/22885181/apple-vaccine-covid-19-booster-shot-employees\">Apple</a> are requiring employees to submit proof of a COVID-19 booster shot.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/xnV91DFz9CSu7C0xxIcffYIW-8k=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19367784/acastro_191108_1777_t-mobile_0002.0.jpg",
  "description": "T-Mobile will make \"limited\" exceptions.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}