{
  "title": "The IRS is reportedly looking for ID.me alternatives amid privacy concerns",
  "url": "https://www.theverge.com/2022/1/29/22907853/irs-idme-facial-recognition-alternatives-privacy-concerns",
  "date": "2022-01-29T18:50:39.000Z",
  "author": "Emma Roth",
  "content": "      <figure>      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/1Q2_UGitli_BFvfI6_2fkT82SoE=/0x0:2040x1360/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/70447992/acastro_180730_1777_facial_recognition_0003.0.jpg\" />        <figcaption>Illustration by Alex Castro / The Verge</figcaption>    </figure>  <p id=\"QAEwWf\">The Treasury Department and Internal Revenue Service (IRS) are reportedly looking for alternatives to the controversial facial recognition software ID.me, according to <a href=\"https://www.bloomberg.com/news/articles/2022-01-28/treasury-weighing-id-me-alternatives-over-privacy-concerns\">a report by <em>Bloomberg</em></a>. As <em>Bloomberg</em> notes, the agencies didn’t cite a reason for the possible change, and also didn’t mention any privacy concerns about the service.</p><div class=\"c-float-right\"><aside id=\"VMIhNA\"><q>The IRS can’t establish its own software due to a “lack of funding”</q></aside></div><p id=\"EFcq31\">“The IRS is consistently looking for ways to make the filing process more secure,” Treasury Department spokesperson Alexandra LaManna said in a statement to <em>Bloomberg</em>. “We believe in the importance of protecting the privacy of taxpayers, while also ensuring criminals are not able to gain access to taxpayer accounts.” LaManna also told <em>Bloomberg</em> users aren’t obligated to file their taxes online and that it’s unlikely for the department to establish in-house software due to a “lack of funding for IRS modernization.” The IRS and ID.me didn’t immediately respond to <em>The Verge</em>’s request for comment.</p><p id=\"2ZKjHC\"><a href=\"https://www.irs.gov/newsroom/new-identity-verification-process-to-access-certain-irs-online-tools-and-services\">Last year, the IRS announced</a> its plans <a href=\"https://www.theverge.com/2022/1/20/22893057/irs-facial-recognition-taxes-online-idme-identity\">to start requiring people who file their taxes online </a>to register with third-party facial recognition company ID.me. Through the service, users will have to submit a video selfie using a webcam or mobile device to verify their identity. The IRS is supposed to roll out the program this summer. </p><p id=\"l6rnlk\">Although ID.me previously claimed it only uses one-to-one facial matching, which involves matching a user’s face with images of the same face, ID.me <a href=\"https://www.theverge.com/2022/1/26/22903437/id-me-facial-recognition-databases-irs-match\">CEO Blake Hall admitted it uses technology that matches faces against a larger database</a>. This only exacerbates privacy concerns — <a href=\"https://twitter.com/tedlieu/status/1486788730241257476?s=20&amp;t=xOA17nHmuAN3ewlOyfmAHw\">politicians</a>, the <a href=\"https://twitter.com/ACLU/status/1484552049656270853?s=20&amp;t=MIpQx-YGjfDAK68vLrlJeA\">American Civil Liberties Union</a>, and <a href=\"https://twitter.com/fightfortheftr/status/1487206171903729664?s=20&amp;t=Iz25Z2tI2SZDcoYi0tcIlQ\">digital rights advocates</a> have already spoken out about the IRS’ use of the software.</p><p id=\"p9yYN5\">The <a href=\"https://help.id.me/hc/en-us\">US government currently employs ID.me</a> to verify people’s identity for Social Security, state benefits, and Veterans Affairs. In 2021, a number of people who used ID.me to verify their state benefits reported <a href=\"https://www.theverge.com/2021/6/19/22541427/facial-recognition-software-verify-unemployment-benefits-id-me\">having their benefits denied or applications put on hold</a> due to possible issues with the software.</p>",
  "image": "https://cdn.vox-cdn.com/thumbor/x3VLjI4OFWFNXl9jMMXAnN78hZI=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11900073/acastro_180730_1777_facial_recognition_0003.jpg",
  "description": "The IRS may be reconsidering its partnership.",
  "publisher": "The Verge",
  "publisherUrl": "https://www.theverge.com/"
}