{
  "title": "Review: DJI Mic – a super-flexible wireless microphone w/ AirPods-like charging case [Video]",
  "url": "https://9to5mac.com/2022/01/29/dji-mic-review-wireless-microphone-system-mfi-iphone/",
  "date": "Sat, 29 Jan 2022 19:00:54 +0000",
  "content": "<div class=\"feat-image\"><img src=\"https://9to5mac.com/wp-content/uploads/sites/6/2022/01/DJI-Mic-Review-9to5mac.jpg?quality=82&#038;strip=all&#038;w=1600\" /></div><p>If you&#8217;re looking to step up the production value of your videos shot on iPhone, then boosting the sound quality is an easy way to do so. While no shortage of hardwired external microphones are available, a truly wireless microphone setup, like what we find with the <a href=\"https://dronedj.com/2021/10/28/dji-mic/\">late-2021-announced DJI Mic</a>, provides much greater flexibility.</p><p>The $329 DJI Mic, which is <a href=\"https://bhpho.to/3FVwEec\">now available for pre-order</a>, is a wireless microphone system based around two transmitters and a receiver. The receiver comes with a Lightning and USB-C attachment for iPhone and iPad connectivity, enabling wireless audio for these portable devices over a fairly long distance.</p><p>What separates the DJI Mic from popular competitors like <a href=\"https://bhpho.to/3fZyfVS\">Rode&#8217;s Wireless Go II</a>, is that DJI includes a handy AirPods-esque charging case for recharging both transmitters and the receiver. This is not only convenient for charging, but also helps to keep up with all of the components in one place. </p><p>Thanks to its internal 8GB of storage, the transmitters can operate as a standalone recorder — just clip it on your collar and press the record button. But the DJI Mic also connects to mirrorless cameras, Android devices, iOS devices, and even functions as a wireless microphone for your Mac. Watch our DJI Mic hands-on video for the details.</p><p> <a href=\"https://9to5mac.com/2022/01/29/dji-mic-review-wireless-microphone-system-mfi-iphone/#more-782886\" class=\"more-link\">more&#8230;</a></p><p>The post <a rel=\"nofollow\" href=\"https://9to5mac.com/2022/01/29/dji-mic-review-wireless-microphone-system-mfi-iphone/\">Review: DJI Mic &#8211; a super-flexible wireless microphone w/ AirPods-like charging case [Video]</a> appeared first on <a rel=\"nofollow\" href=\"https://9to5mac.com\">9to5Mac</a>.</p>",
  "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/01/DJI-Mic-Review-9to5mac.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "description": "The DJI Mic is a super-flexible Made for iPhone wireless microphone system with AirPods-style charging case, dual transmitters, and receiver.",
  "publisher": "9to5Mac",
  "publisherUrl": "http://9to5mac.com/"
}