{
  "title": "How to find a job as a software engineer",
  "url": "https://flaviocopes.com/how-to-find-job/",
  "date": "Mon, 10 Jan 2022 07:00:00 +0200",
  "content": "        <p>In this post I want to point you in the right direction when it comes to finding your first job in tech.</p><p>Once you put your foot in the door it&rsquo;s much easier to switch jobs, upgrade to a better salary. But getting your first job is probably the most difficult thing.</p><h2 id=\"how-to-prepare-to-apply-to-a-job\">How to prepare to apply to a job</h2><p>Before thinking about applying to any job, you must prepare for it. This is something that might require weeks, or even months if you start your online presence from zero. Not all of the things I&rsquo;m going to mention here are required to get a job, but they certainly help.</p><p>I think that starting doing what I mention at the beginning of your learning process is a big plus. My advice is to <strong>publicly document your learning process</strong> along the way on your blog.</p><p>Create your own website on your own domain (<code>yourname.com</code>) and make it your home on the Internet. All your online presence will bring back to this place.</p><p>I personally advice against using platforms like Medium, <code>dev.to</code> and other sites that are basically aggregators, because writing on your own blog has a much different weight. Any time you post anything on your blog will improve your personal brand. It&rsquo;s your property. It&rsquo;s like building on your own property vs building on someone else&rsquo;s property.</p><p>This is the first thing I advice. Start writing one blog post per week explaining what you are learning. This has the double benefit of publicly documenting your knowledge, and it helps you solidify your learnings because the moment you need to explain something, you are going to understand it more.</p><p>Do not have fear of being judged and don&rsquo;t fall in the trap of &ldquo;I know very little&rdquo;. That&rsquo;s still more than what 99% of the population knows, and over time this will compound into a solid knowledge base, and it will positively affect your personal brand.</p><p>Try to search your name on Google. The first result should be your blog. People that are in charge of hiring at a company will search for your name on Google, and make sure your home on the Internet is positioning you well as a professional.</p><p>Try to curate your online presence as much as possible.</p><p>After your blog, it comes Social Media. Twitter and LinkedIn are two of the most obvious places for tech professionals.</p><p>Twitter for networking, LinkedIn is also useful to receive proposals from recruiters, people whose job is to  find the right people for companies that then pay them a commission.</p><p>Recruiters can be a great help, so having an up to date LinkedIn profile is worth it.</p><p>It&rsquo;s also worth being active on those social networks, perhaps posting updates on your learnings and progress. I call that working in public.</p><p>I think working in public never ends. If you make it part of your culture, it&rsquo;s going to make a major difference in your career trajectory.</p><p>Along the way you will make connections and friendships, and this will be key in the next phase, when you&rsquo;ll be actively looking for a job.</p><p>Next you have GitHub. GitHub is the place where your code lives. Every tech company recruiter will look at your GitHub profile. One good way to fill it is to make it the home of your portfolio. I highly recommend to work on your own projects, to serve as portfolio. Perhaps find existing projects from courses and add new functionality and features. Put them on GitHub. Imagine having 10 or 15 well-done projects, even if small in scale, and applying at a company.</p><p>The recruiters will look at those, they will immediately see what you are capable of. You&rsquo;re immediately ahead of the competition.</p><h2 id=\"decide-which-kind-of-job-you-want-to-apply-to\">Decide which kind of job you want to apply to</h2><p>Before applying to a job, you need to decide which kind of job you want to apply to.</p><p>One of the biggest questions might be <strong>remote or onsite</strong>. For your first job I would highly recommend an onsite job, because you will need a lot of mentoring in the beginning, and it&rsquo;s just better on a human level.</p><p>You might feel more isolated and less motivated, working remotely.</p><p>You can always switch to a remote job later on.</p><p>Another big question is if you want to apply to a <strong>big company or a small company</strong>. This is a matter of preferences. I&rsquo;d always choose a small company over a big one, but that&rsquo;s just me. If your dream is to work at Google, it&rsquo;s great. If your dream is to work with 6-8 people and make friends with everyone at the company, it&rsquo;s great as well.</p><p>Another big question is the role of tech in the company. Tech-first companies are companies whose product is tech based. Other companies use tech to provide their main product, but tech is not the product. I&rsquo;d always choose companies whose product is tech based. They will invest more in you, you will not have to fight to get the right tools, training, budget and consideration for tech choices, and tech will always be the priority.</p><h2 id=\"where-to-find-jobs-and-opportunities\">Where to find jobs and opportunities</h2><p>The most obvious place to look for jobs on the Internet is online job boards, but that might not be the best place.</p><p>One thing to avoid is to blindly send CVs in mass.</p><p>And avoid shooting for the stars. Everyone wants to work at the cool companies, but they might have too many applications to have a chance.</p><p>The advice I commonly give is to pick 3-4 small companies you&rsquo;d love to work for, in your area or in the area you want to move to, and do your best to introduce yourself and get known.</p><p>Small companies are always looking for talent locally, and when there&rsquo;s an opening that you might fill, they will think of you.</p><p>I recommend going to local tech events and meetups. Small conferences in your area, or bigger conferences too. Events are where you make connections with other people. I think networking is very important. The more people you know, online or offline, the more opportunities you will have, now and in the future. Many companies will organize events from time to time to &ldquo;scout for talent&rdquo;. At big conferences you might meet developers working at companies that are hiring. That&rsquo;s I found some of my opportunities.</p><p>That said, online job postings might still be a good option, especially when you want to work remotely or for a company in a different country because in your country you can&rsquo;t find a good option. Every company has a &ldquo;jobs&rdquo; page on their site. Apply to work for them with a carefully crafted cover letter.</p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "Tips and strategies to get your first programming job",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}