{
  "title": "I stopped publishing daily blog posts",
  "url": "https://flaviocopes.com/stopped-publishing-daily/",
  "date": "Thu, 20 Jan 2022 07:00:00 +0200",
  "content": "        <p>The attentive readers already figured out I stopped publishing every day on the blog since last week.</p><p>I&rsquo;m switching the schedule to one blog post a week.</p><p>I have written 1 blog post every day for 4 years, and it&rsquo;s been a tremendous help in growing the blog and producing helpful learning material for developers.</p><p>It&rsquo;s one thing that I&rsquo;ve been thinking many times. When will I stop? Will I ever stop? After all the blog is the most successful thing, work-related, that I&rsquo;ve ever created. It enabled me to start creating courses for developers and make a living from this activity.</p><p>The main reason for the change of schedule, or the drop that breaks the camel&rsquo;s back, is that 10 weeks from now I&rsquo;ll open signups to the 2022 edition of the Bootcamp and since this year I&rsquo;m doing a complete overhaul of the content and the projects that we&rsquo;ll work on in the program, the next few months will be very intensive.</p><p>And then once the bootcamp starts it will be even more intensive. As I learned in the past 2 editions, the bootcamp is an immersive experience. It lasts 20 weeks and it&rsquo;s a lot of work.</p><p>So in order to avoid burning the midnight oil, I have to cut somewhere. I&rsquo;m not cutting in the Bootcamp quality for obvious reasons, as that&rsquo;s what I believe my best course ever and it&rsquo;s something that a lot of people are waiting for (the waiting list is now at almost 4000).</p><p>So at least for the next 6 months I&rsquo;ll reduce the quantity. But I&rsquo;ll try to not reduce quality. I don&rsquo;t want to write 7 shitty posts a week. I want to write 1 good and useful one.</p><p>It&rsquo;s been a great streak. I have written more than 1500 blog posts now, and I&rsquo;ll continue writing them, just at a slower pace.</p><p>You might have noticed I started publishing on YouTube every day now, since the beginning of the year. So you might think that I&rsquo;m just spending more time on that instead of the blog?</p><p>But the reality is that on YouTube I&rsquo;m doing more casual content. I spend a lot of time every day reading stuff on the Internet in the computers and tech space and the idea is to make a &ldquo;reaction channel&rdquo; where I put my opinions on things.</p><p>So it&rsquo;s pretty easy for me to make a video, I don&rsquo;t have to think about what do do because every day I have more ideas than what I can work on.</p><p>It feels fun and I learned over time that when I find something that others feel like work but I feel like fun, I need to concentrate on that.</p><p>After 4 years of daily blogging it&rsquo;s time to do some novel things. The novelty might wear off, but if I can establish a habit and stick to it, I can grow that to something useful and interesting to others.</p><p>So.. <a href=\"https://www.youtube.com/user/copesc/videos\">subscribe</a> 😁</p>      ",
  "image": "https://flaviocopes.com/img/avatar.png",
  "description": "The attentive readers already figured out I stopped publishing every day on the blog since last week.\nI’m switching the schedule to one blog post a week.\nI have written 1 blog post every day for 4 years, and it’s been a tremendous help in growing the blog and producing helpful learning material for developers.\nIt’s one thing that I’ve been thinking many times. When will I stop? Will I ever stop?",
  "publisher": "Flaviocopes",
  "publisherUrl": "https://flaviocopes.com/"
}